<?php

namespace sammo;

class CityConst extends CityConstBase{
    public static $regionMap = [
        '관동 지방'=>1,1=>'관동 지방',
    ];

    protected static $initCity = [
        //id,  도시,               규모, 인구, 농, 상, 치, 성, 수,(x100)지역,     x,   y, 연결도시
        [	1	, "태초마을",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	169	, 	321	, ["상록시티", "홍련마을"]],
        [	2	, "상록시티",           "소", 9000, 60, 60, 40, 60, 60, "관동 지방", 	169	, 	231	, ["태초마을", "회색시티", "챔피언로드(입구)"]],
        [	3	, "회색시티",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	174	, 	104	, ["상록시티", "달맞이산"]],
        [	4	, "달맞이산",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	297	, 	94	, ["회색시티", "블루시티"]],
        [	5	, "블루시티",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	452	, 	92	, ["달맞이산", "노랑시티", "무인발전소", "블루시티동굴"]],
        [	6	, "갈색시티",           "대",15000,100,100, 80,100,100, "관동 지방", 	451	, 	278	, ["IC", "노랑시티"]],
        [	7	, "보라타운",           "소",12000, 60, 60, 40, 60, 60, "관동 지방", 	627	, 	180	, ["IC", "노랑시티", "무인발전소"]],
        [	8	, "무지개시티",         "특",18000,120,120,100,120,120, "관동 지방", 	343	, 	180	, ["노랑시티", "사이클링로드(입구)"]],
        [	9	, "연분홍시티",         "특",18000,120,120,100,120,120, "관동 지방", 	357	, 	377	, ["사이클링로드(출구)", "관동15로", "쌍둥이섬"]],
        [	10	, "노랑시티",           "특",18000,120,120,100,120,120, "관동 지방", 	451	, 	180	, ["보라타운", "무지개시티", "블루시티", "갈색시티"]],
        [	11	, "홍련마을",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	169	, 	454	, ["태초마을", "쌍둥이섬"]],
        [	12	, "챔피언로드(입구)",   "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	90	, 	231	, ["상록시티", "챔피언로드(동굴)"]],
        [	13	, "챔피언로드(동굴)",   "대",15000,100,100, 80,100,100, "관동 지방", 	90	, 	180	, ["석영고원", "챔피언로드(입구)"]],
        [	14	, "석영고원",           "특",18000,120,120,100,120,120, "관동 지방", 	90	, 	29	, ["챔피언로드(동굴)"]],
        [	15	, "사이클링로드(입구)", "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	252	, 	180	, ["무지개시티", "사이클링로드(출구)"]],
        [	16	, "사이클링로드(출구)", "대",15000,100,100, 80,100,100, "관동 지방", 	252	, 	377	, ["사이클링로드(입구)", "연분홍시티"]],
        [	17	, "관동15로",           "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	451	, 	377	, ["연분홍시티", "관동13로"]],
        [	18	, "무인발전소",         "대",15000,100,100, 80,100,100, "관동 지방", 	627	, 	94	, ["보라타운", "블루시티"]],
        [	19	, "IC",                 "소", 9000, 60, 60, 40, 60, 60, "관동 지방", 	627	, 	278	, ["갈색시티", "보라타운", "관동13로"]],
        [	20	, "관동13로",           "소", 9000, 60, 60, 40, 60, 60, "관동 지방", 	627	, 	344	, ["관동15로", "IC"]],
        [	21	, "블루시티동굴",       "중",12000, 80, 80, 60, 80, 80, "관동 지방", 	451	, 	32	, ["블루시티", "이수재의집"]],
        [	22	, "이수재의집",         "대",15000,100,100, 80,100,100, "관동 지방", 	572	, 	32	, ["블루시티동굴"]],
        [	23	, "쌍둥이섬",           "소", 9000, 60, 60, 40, 60, 60, "관동 지방", 	263	, 	454	, ["연분홍시티", "홍련마을"]],
    ];
}